#ifndef __SCRIPT_INT_H__
#define __SCRIPT_INT_H__

const int SCRIPT_OLD = 0;
const int SCRIPT_NEW = 1;

enum 
{
    goto_     =  0xe0,
    if_       =  0xe1,
    call_     =  0xe2,
    add_      =  0xe3,
    sub_      =  0xe4,
    mul_      =  0xe5,
    div_      =  0xe6,
    rest_     =  0xe7,
    equal_    =  0xe8,
    end_      =  0xe9,
    ifequal_  =  0xea,
    or_       =  0xeb,
    and_      =  0xec,
    variable_ =  0xed,
    value_    =  0xee,
    add2_     =  0xef,
    sub2_     =  0xf0,
    mul2_     =  0xf1,
    div2_     =  0xf2,
    rest2_    =  0xf3,
    or2_      =  0xf4,
    and2_     =  0xf5,
};


#ifndef __SCRIPT_C__

    
	extern int  NScriptNo;    //SCRIPT_NO;
    extern int  CLoadScript;  //LOAD_SCRIPT;
    
	extern int  TotalFunction;

#endif

void Incode( char *s );

/* нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх
 ╟╘╝Ў╕э : GetByte
 └╬  └┌ : ╛°└╜
 ╕о┼╧░к : 1╣┘└╠╞о└╟ ░к
 ╝│  ╕э : prog┐б ▒т╖╧╡╚ │╗┐ы┐б╝н 1╣┘└╠╞о╕ж ╕о┼╧╟╧░э prog╞ў└╬┼═╕ж 1┴ї░б
нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх */
BYTE GetByte( void );


/* нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх
 ╟╘╝Ў╕э : GetInt
 └╬  └┌ : ╛°└╜
 ╕о┼╧░к : 4╣┘└╠╞о└╟ ░к
 ╝│  ╕э : prog┐б ▒т╖╧╡╚ │╗┐ы┐б╝н 4╣┘└╠╞о╕ж ╕о┼╧╟╧░э prog╞ў└╬┼═╕ж 4┴ї░б
нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх */
int GetInt( void );


/* нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх
 ╟╘╝Ў╕э : GetString
 └╬  └┌ :
 ╕о┼╧░к : ╣о└┌┐н└╗ └·└х╟╧░э └╓┤┬ ╣ш┐н└╟ ╜├└█ ╞ў└╬┼═
 ╝│  ╕э : ╜║┼й╕│╞о ╡е└╠┼╕┐б╝н ╣о└┌┐н└╗ └╨╛ю╡щ└╬┤┘.
нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх */
void GetString( char *buf );


/* нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх
 ╟╘╝Ў╕э : Script
 └╬  └┌ : ╛°└╜
 ╕о┼╧░к : ╛°└╜
 ╝│  ╕э : ╜║┼й╕│╞о ┴╓ ╜╟╟р▒т
нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх */
void Script( int num );


/* нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх
 ╟╘╝Ў╕э : LoadScript
 └╬  └┌ : name - └╨╛ю╡щ└╠░э└┌ ╟╧┤┬ ╜║┼й╕│╞о ╡е└╠┼╕ ╚н└╧╕э└╠ ╛╞┤╧╢є └╧╖├╣°╚г.
 ╕о┼╧░к :
 ╝│  ╕э : ┴д╗є└√└╕╖╬ └╨╛ю╡щ└╠╕щ 1└╗ ╕о┼╧╟╤┤┘.
нхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнхнх */
int LoadScript( char *scriptname );
int LoadScriptText( char *scrname );




#endif


